app/controllers/students_controller.rb

  def show
    student_id = params[:id]
    @student = Student.find(student_id)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]